Weirdly, this has triggered a lot of issues.

1) a reoccurance of the aws-auth issue that forced a terraform upgrade previously:
```
kubernetes_config_map.aws_auth: Refreshing state... [id=kube-system/aws-auth]

Error: Get "http://localhost/api/v1/namespaces/kube-system/configmaps/aws-auth": dial tcp [::1]:80: connect: connection refused
```

2) Even if I overcome the above by termporarily running kubectl proxy locally, there are lots of changes to be made:
```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_addon_version.eks_addon_aws_ebs_csi_driver will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_addon_version" "eks_addon_aws_ebs_csi_driver"  {
      ~ id                 = "aws-ebs-csi-driver" -> (known after apply)
      ~ kubernetes_version = "1.27" -> (known after apply)
      ~ version            = "v1.27.0-eksbuild.1" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.aws_eks_addon_version.eks_addon_coredns will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_addon_version" "eks_addon_coredns"  {
      ~ id                 = "coredns" -> (known after apply)
      ~ kubernetes_version = "1.27" -> (known after apply)
      ~ version            = "v1.10.1-eksbuild.7" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.aws_eks_addon_version.eks_addon_kube_proxy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_addon_version" "eks_addon_kube_proxy"  {
      ~ id                 = "kube-proxy" -> (known after apply)
      ~ kubernetes_version = "1.27" -> (known after apply)
      ~ version            = "v1.27.8-eksbuild.4" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.aws_eks_addon_version.eks_addon_vpc_cni will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_addon_version" "eks_addon_vpc_cni"  {
      ~ id                 = "vpc-cni" -> (known after apply)
      ~ kubernetes_version = "1.27" -> (known after apply)
      ~ version            = "v1.16.2-eksbuild.1" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.aws_eks_cluster.main will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "main"  {
      ~ arn                       = "arn:aws:eks:us-east-1:512686554592:cluster/kubernetes-aws--flux-test" -> (known after apply)
      ~ certificate_authority     = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUN5RENDQWJDZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJd01EUXhOakUxTkRZeE9Gb1hEVE13TURReE5ERTFORFl4T0Zvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTG1JCnMrbVpQcTgvUFpkN2tVdXhqYU90ZlhZeFh4cnE3dDhaRkYyaW9VZlZ5RUVEd2JvbDl2Q3hERyt6L0YwT2dVL20KeVFCTFN3SlJpaDU1WFBrSGhEczBKUFJna1FTVkVhTFIyK3pORVNNR3RlUWpmM0x2aThiYnBIdFZhL3VCa05Lego5UFFSWUxORWIwaEwrYVJFSEJGTHMwS2VGemZ6cjNGZFZQWTJuckg4TWk3VWhlczB5WGJBNm1TdE9HNnpKaUxYCmZ5Y2h4VVArSXFYNmlhaFkwZ2RDRGhHUXA4cWJNblRCTGRjem40ZXV6MnFubGRiN2JybHJEVWU4czB4L2NxNHYKMFRJL0tUY2k5WHNRZURBN29IdTN0eHNTTmUxM3dVVGgzdXZJZTd3UUVpMTRxUXpxQVpHWmlEU2JLc09BUTRvZgp2WnpGSWU4VzU1SGJhUDh0ZlBVQ0F3RUFBYU1qTUNFd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQkFENVRYOGcwZHNtL3hCMzA2UWpoci9neFR5cTQKQm9NeDNZMGxqcE5lTURtNEE3TGxrSHAydVE2K2VUNUNSakU0MXkyeVo5VHpROVE5SUd1QVd6NkxxelYxbmJFbgphUjcwVHUxRngzME41M0F0WCtpWklRdWpsNWJINVliR1pyaVRvd28vS01Bb1JpSmc3UDNwVjZUVHk2N04xWUlsCmhKYkdqUFBQWFJWdHMwMDgzTkJkZTEvYmMycWsxMEVGNXFwYVBtUDFoRzQrWmNQVjFTeldsZFhGOERaV0lQOGUKVVpvcmVMM2lCVXJtalE0WGlGNkIvZTdML3pHSHFWTnl0N3ZOVm9pdjZwOG9wQUJjcjk4aXN0eUVVM0hvYm0yMAoybjc1d2pROFlsNmczQXpMMmFIbjJzaW14Z2I1N1B5N29CdVlsSnBKZUZrbW5lNE14clpFeHBScDBBND0KLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo="
            },
        ] -> (known after apply)
      + cluster_id                = (known after apply)
      ~ created_at                = "2020-04-16 15:38:07.067 +0000 UTC" -> (known after apply)
      ~ enabled_cluster_log_types = [] -> (known after apply)
      ~ endpoint                  = "https://C44C02779528D1AE873C5052FC630D5C.gr7.us-east-1.eks.amazonaws.com" -> (known after apply)
      ~ id                        = "kubernetes-aws--flux-test" -> (known after apply)
      ~ identity                  = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.us-east-1.amazonaws.com/id/C44C02779528D1AE873C5052FC630D5C"
                    },
                ]
            },
        ] -> (known after apply)
      ~ kubernetes_network_config = [
          - {
              - ip_family         = "ipv4"
              - service_ipv4_cidr = "172.20.0.0/16"
              - service_ipv6_cidr = ""
            },
        ] -> (known after apply)
        name                      = "kubernetes-aws--flux-test"
      ~ outpost_config            = [] -> (known after apply)
      ~ platform_version          = "eks.11" -> (known after apply)
      ~ role_arn                  = "arn:aws:iam::512686554592:role/kubernetes-aws--flux-test--AmazonEKSMasterRole" -> (known after apply)
      ~ status                    = "ACTIVE" -> (known after apply)
      ~ tags                      = {} -> (known after apply)
      ~ version                   = "1.27" -> (known after apply)
      ~ vpc_config                = [
          - {
              - cluster_security_group_id = "sg-0736fa8a5b5ec254f"
              - endpoint_private_access   = false
              - endpoint_public_access    = true
              - public_access_cidrs       = [
                  - "0.0.0.0/0",
                ]
              - security_group_ids        = [
                  - "sg-07cd6c9049eea2715",
                ]
              - subnet_ids                = [
                  - "subnet-009a04cbefc8e3661",
                  - "subnet-0c60bc3cb24a2816b",
                ]
              - vpc_id                    = "vpc-78a2071d"
            },
        ] -> (known after apply)
    }

  # data.aws_eks_cluster_auth.main will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "main"  {
      ~ id    = "kubernetes-aws--flux-test" -> (known after apply)
        name  = "kubernetes-aws--flux-test"
      ~ token = (sensitive value)
    }

  # data.tls_certificate.oidc_cert will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "oidc_cert"  {
      ~ certificates = [
          - {
              - cert_pem             = <<-EOT
                    -----BEGIN CERTIFICATE-----
                    MIIEdTCCA12gAwIBAgIJAKcOSkw0grd/MA0GCSqGSIb3DQEBCwUAMGgxCzAJBgNV
                    BAYTAlVTMSUwIwYDVQQKExxTdGFyZmllbGQgVGVjaG5vbG9naWVzLCBJbmMuMTIw
                    MAYDVQQLEylTdGFyZmllbGQgQ2xhc3MgMiBDZXJ0aWZpY2F0aW9uIEF1dGhvcml0
                    eTAeFw0wOTA5MDIwMDAwMDBaFw0zNDA2MjgxNzM5MTZaMIGYMQswCQYDVQQGEwJV
                    UzEQMA4GA1UECBMHQXJpem9uYTETMBEGA1UEBxMKU2NvdHRzZGFsZTElMCMGA1UE
                    ChMcU3RhcmZpZWxkIFRlY2hub2xvZ2llcywgSW5jLjE7MDkGA1UEAxMyU3RhcmZp
                    ZWxkIFNlcnZpY2VzIFJvb3QgQ2VydGlmaWNhdGUgQXV0aG9yaXR5IC0gRzIwggEi
                    MA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQDVDDrEKvlO4vW+GZdfjohTsR8/
                    y8+fIBNtKTrID30892t2OGPZNmCom15cAICyL1l/9of5JUOG52kbUpqQ4XHj2C0N
                    Tm/2yEnZtvMaVq4rtnQU68/7JuMauh2WLmo7WJSJR1b/JaCTcFOD2oR0FMNnngRo
                    Ot+OQFodSk7PQ5E751bWAHDLUu57fa4657wx+UX2wmDPE1kCK4DMNEffud6QZW0C
                    zyyRpqbn3oUYSXxmTqM6bam17jQuug0DuDPfR+uxa40l2ZvOgdFFRjKWcIfeAg5J
                    Q4W2bHO7ZOphQazJ1FTfhy/HIrImzJ9ZVGif/L4qL8RVHHVAYBeFAlU5i38FAgMB
                    AAGjgfAwge0wDwYDVR0TAQH/BAUwAwEB/zAOBgNVHQ8BAf8EBAMCAYYwHQYDVR0O
                    BBYEFJxfAN+qAdcwKziIorhtSpzyEZGDMB8GA1UdIwQYMBaAFL9ft9HO3R+G9FtV
                    rNzXEMIOqYjnME8GCCsGAQUFBwEBBEMwQTAcBggrBgEFBQcwAYYQaHR0cDovL28u
                    c3MyLnVzLzAhBggrBgEFBQcwAoYVaHR0cDovL3guc3MyLnVzL3guY2VyMCYGA1Ud
                    HwQfMB0wG6AZoBeGFWh0dHA6Ly9zLnNzMi51cy9yLmNybDARBgNVHSAECjAIMAYG
                    BFUdIAAwDQYJKoZIhvcNAQELBQADggEBACMd44pXyn3pF3lM8R5V/cxTbj5HD9/G
                    VfKyBDbtgB9TxF00KGu+x1X8Z+rLP3+QsjPNG1gQggL4+C/1E2DUBc7xgQjB3ad1
                    l08YuW3e95ORCLp+QCztweq7dp4zBncdDQh/U90bZKuCJ/Fp1U1ervShw3WnWEQt
                    8jxwmKy6abaVd38PMV4s/KCHOkdp8Hlf9BRUpJVeEXgSYCfOn8J3/yNTd126/+pZ
                    59vPr5KW7ySaNRB6nJHGDn2Z9j8Z3/VyVOEVqQdZe4O/Ui5GjLIAZHYcSNPYeehu
                    VsyuLAOQ1xk4meTKCRlb/weWsKh/NEnfVqn3sF/tM+2MR7cwA130A4w=
                    -----END CERTIFICATE-----
                EOT
              - is_ca                = true
              - issuer               = "OU=Starfield Class 2 Certification Authority,O=Starfield Technologies\\, Inc.,C=US"
              - not_after            = "2034-06-28T17:39:16Z"
              - not_before           = "2009-09-02T00:00:00Z"
              - public_key_algorithm = "RSA"
              - serial_number        = "12037640545166866303"
              - sha1_fingerprint     = "9e99a48a9960b14926bb7f3b02e22da2b0ab7280"
              - signature_algorithm  = "SHA256-RSA"
              - subject              = "CN=Starfield Services Root Certificate Authority - G2,O=Starfield Technologies\\, Inc.,L=Scottsdale,ST=Arizona,C=US"
              - version              = 3
            },
          - {
              - cert_pem             = <<-EOT
                    -----BEGIN CERTIFICATE-----
                    MIIEkjCCA3qgAwIBAgITBn+USionzfP6wq4rAfkI7rnExjANBgkqhkiG9w0BAQsF
                    ADCBmDELMAkGA1UEBhMCVVMxEDAOBgNVBAgTB0FyaXpvbmExEzARBgNVBAcTClNj
                    b3R0c2RhbGUxJTAjBgNVBAoTHFN0YXJmaWVsZCBUZWNobm9sb2dpZXMsIEluYy4x
                    OzA5BgNVBAMTMlN0YXJmaWVsZCBTZXJ2aWNlcyBSb290IENlcnRpZmljYXRlIEF1
                    dGhvcml0eSAtIEcyMB4XDTE1MDUyNTEyMDAwMFoXDTM3MTIzMTAxMDAwMFowOTEL
                    MAkGA1UEBhMCVVMxDzANBgNVBAoTBkFtYXpvbjEZMBcGA1UEAxMQQW1hem9uIFJv
                    b3QgQ0EgMTCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBALJ4gHHKeNXj
                    ca9HgFB0fW7Y14h29Jlo91ghYPl0hAEvrAIthtOgQ3pOsqTQNroBvo3bSMgHFzZM
                    9O6II8c+6zf1tRn4SWiw3te5djgdYZ6k/oI2peVKVuRF4fn9tBb6dNqcmzU5L/qw
                    IFAGbHrQgLKm+a/sRxmPUDgH3KKHOVj4utWp+UhnMJbulHheb4mjUcAwhmahRWa6
                    VOujw5H5SNz/0egwLX0tdHA114gk957EWW67c4cX8jJGKLhD+rcdqsq08p8kDi1L
                    93FcXmn/6pUCyziKrlA4b9v7LWIbxcceVOF34GfID5yHI9Y/QCB/IIDEgEw+OyQm
                    jgSubJrIqg0CAwEAAaOCATEwggEtMA8GA1UdEwEB/wQFMAMBAf8wDgYDVR0PAQH/
                    BAQDAgGGMB0GA1UdDgQWBBSEGMyFNOy8DJSULghZnMeyEE4KCDAfBgNVHSMEGDAW
                    gBScXwDfqgHXMCs4iKK4bUqc8hGRgzB4BggrBgEFBQcBAQRsMGowLgYIKwYBBQUH
                    MAGGImh0dHA6Ly9vY3NwLnJvb3RnMi5hbWF6b250cnVzdC5jb20wOAYIKwYBBQUH
                    MAKGLGh0dHA6Ly9jcnQucm9vdGcyLmFtYXpvbnRydXN0LmNvbS9yb290ZzIuY2Vy
                    MD0GA1UdHwQ2MDQwMqAwoC6GLGh0dHA6Ly9jcmwucm9vdGcyLmFtYXpvbnRydXN0
                    LmNvbS9yb290ZzIuY3JsMBEGA1UdIAQKMAgwBgYEVR0gADANBgkqhkiG9w0BAQsF
                    AAOCAQEAYjdCXLwQtT6LLOkMm2xF4gcAevnFWAu5CIw+7bMlPLVvUOTNNWqnkzSW
                    MiGpSESrnO09tKpzbeR/FoCJbM8oAxiDR3mjEH4wW6w7sGDgd9QIpuEdfF7Au/ma
                    eyKdpwAJfqxGF4PcnCZXmTA5YpaP7dreqsXMGz7KQ2hsVxa81Q4gLv7/wmpdLqBK
                    bRRYh5TmOTFffHPLkIhqhBGWJ6bt2YFGpn6jcgAKUj6DiAdjd4lpFw85hdKrCEVN
                    0FE6/V1dN2RMfjCyVSRCnTawXZwXgWHxyvkQAiSr6w10kY17RSlQOYiypok1JR4U
                    akcjMS9cmvqtmg5iUaQqqcT5NJ0hGA==
                    -----END CERTIFICATE-----
                EOT
              - is_ca                = true
              - issuer               = "CN=Starfield Services Root Certificate Authority - G2,O=Starfield Technologies\\, Inc.,L=Scottsdale,ST=Arizona,C=US"
              - not_after            = "2037-12-31T01:00:00Z"
              - not_before           = "2015-05-25T12:00:00Z"
              - public_key_algorithm = "RSA"
              - serial_number        = "144918191876577076464031512351042010504348870"
              - sha1_fingerprint     = "06b25927c42a721631c1efd9431e648fa62e1e39"
              - signature_algorithm  = "SHA256-RSA"
              - subject              = "CN=Amazon Root CA 1,O=Amazon,C=US"
              - version              = 3
            },
          - {
              - cert_pem             = <<-EOT
                    -----BEGIN CERTIFICATE-----
                    MIIEXjCCA0agAwIBAgITB3MSSkvL1E7HtTvq8ZSELToPoTANBgkqhkiG9w0BAQsF
                    ADA5MQswCQYDVQQGEwJVUzEPMA0GA1UEChMGQW1hem9uMRkwFwYDVQQDExBBbWF6
                    b24gUm9vdCBDQSAxMB4XDTIyMDgyMzIyMjUzMFoXDTMwMDgyMzIyMjUzMFowPDEL
                    MAkGA1UEBhMCVVMxDzANBgNVBAoTBkFtYXpvbjEcMBoGA1UEAxMTQW1hem9uIFJT
                    QSAyMDQ4IE0wMjCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBALtDGMZa
                    qHneKei1by6+pUPPLljTB143Si6VpEWPc6mSkFhZb/6qrkZyoHlQLbDYnI2D7hD0
                    sdzEqfnuAjIsuXQLG3A8TvX6V3oFNBFVe8NlLJHvBseKY88saLwufxkZVwk74g4n
                    WlNMXzla9Y5F3wwRHwMVH443xGz6UtGSZSqQ94eFx5X7Tlqt8whi8qCaKdZ5rNak
                    +r9nUThOeClqFd4oXych//Rc7Y0eX1KNWHYSI1Nk31mYgiK3JvH063g+K9tHA63Z
                    eTgKgndlh+WI+zv7i44HepRZjA1FYwYZ9Vv/9UkC5Yz8/yU65fgjaE+wVHM4e/Yy
                    C2osrPWE7gJ+dXMCAwEAAaOCAVowggFWMBIGA1UdEwEB/wQIMAYBAf8CAQAwDgYD
                    VR0PAQH/BAQDAgGGMB0GA1UdJQQWMBQGCCsGAQUFBwMBBggrBgEFBQcDAjAdBgNV
                    HQ4EFgQUwDFSzVpQw4J8dHHOy+mc+XrrguIwHwYDVR0jBBgwFoAUhBjMhTTsvAyU
                    lC4IWZzHshBOCggwewYIKwYBBQUHAQEEbzBtMC8GCCsGAQUFBzABhiNodHRwOi8v
                    b2NzcC5yb290Y2ExLmFtYXpvbnRydXN0LmNvbTA6BggrBgEFBQcwAoYuaHR0cDov
                    L2NydC5yb290Y2ExLmFtYXpvbnRydXN0LmNvbS9yb290Y2ExLmNlcjA/BgNVHR8E
                    ODA2MDSgMqAwhi5odHRwOi8vY3JsLnJvb3RjYTEuYW1hem9udHJ1c3QuY29tL3Jv
                    b3RjYTEuY3JsMBMGA1UdIAQMMAowCAYGZ4EMAQIBMA0GCSqGSIb3DQEBCwUAA4IB
                    AQAtTi6Fs0Azfi+iwm7jrz+CSxHH+uHl7Law3MQSXVtR8RV53PtR6r/6gNpqlzdo
                    Zq4FKbADi1v9Bun8RY8D51uedRfjsbeodizeBB8nXmeyD33Ep7VATj4ozcd31YFV
                    fgRhvTSxNrrTlNpWkUk0m3BMPv8sg381HhA6uEYokE5q9uws/3YkKqRiEz3TsaWm
                    JqIRZhMbgAfp7O7FUwFIb7UIspogZSKxPIWJpxiPo3TcBambbVtQOcNRWz5qCQdD
                    slI2yayq0n2TXoHyNCLEH8rpsJRVILFsg0jc7BaFrMnF462+ajSehgj12IidNeRN
                    4zl+EoNaWdpnWndvSpAEkq2P
                    -----END CERTIFICATE-----
                EOT
              - is_ca                = true
              - issuer               = "CN=Amazon Root CA 1,O=Amazon,C=US"
              - not_after            = "2030-08-23T22:25:30Z"
              - not_before           = "2022-08-23T22:25:30Z"
              - public_key_algorithm = "RSA"
              - serial_number        = "166129353110899469622597955040406457904926625"
              - sha1_fingerprint     = "414a2060b738c635cc7fc243e052615592830c53"
              - signature_algorithm  = "SHA256-RSA"
              - subject              = "CN=Amazon RSA 2048 M02,O=Amazon,C=US"
              - version              = 3
            },
          - {
              - cert_pem             = <<-EOT
                    -----BEGIN CERTIFICATE-----
                    MIIF7DCCBNSgAwIBAgIQByOkjeOvl//8xMrhlZkruzANBgkqhkiG9w0BAQsFADA8
                    MQswCQYDVQQGEwJVUzEPMA0GA1UEChMGQW1hem9uMRwwGgYDVQQDExNBbWF6b24g
                    UlNBIDIwNDggTTAyMB4XDTIzMDUxMzAwMDAwMFoXDTI0MDYxMDIzNTk1OVowKzEp
                    MCcGA1UEAxMgb2lkYy5la3MudXMtZWFzdC0xLmFtYXpvbmF3cy5jb20wggEiMA0G
                    CSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQClT+mO1HZk/Gp/3sS6BO8QDhG0yK53
                    E11wkdlUn9HEomcqZ2VVhbEG4ahOZY5MLUqIQViMswUueYFov57zyGnPSnH0IrMu
                    mL3/dqxEwP96VPm5ZgbjCfartRfJcuYmmMCoWxocMdTq09ECEjawt47i4FmOLJmH
                    +UUnisQgHMvPHtCrfL1WYAgdN3ls4meIFkS1CVHLmoCG9MuponJu3+uqw9UHxPZz
                    vGLezHUUSzLE0+b+1Wd6DAPJBZmCa+PBweaRfrlqhhgW+QHcCK7XxlfwMxvzwmdv
                    icOBHF7SJM/o3opUvrUf/XJCtCDHuv0GQNxyCcpJImQJ4Ae0MtEihY/rAgMBAAGj
                    ggL5MIIC9TAfBgNVHSMEGDAWgBTAMVLNWlDDgnx0cc7L6Zz5euuC4jAdBgNVHQ4E
                    FgQUeamiamg4o8YroTJziJnlxHJnDdEwKwYDVR0RBCQwIoIgb2lkYy5la3MudXMt
                    ZWFzdC0xLmFtYXpvbmF3cy5jb20wDgYDVR0PAQH/BAQDAgWgMB0GA1UdJQQWMBQG
                    CCsGAQUFBwMBBggrBgEFBQcDAjA7BgNVHR8ENDAyMDCgLqAshipodHRwOi8vY3Js
                    LnIybTAyLmFtYXpvbnRydXN0LmNvbS9yMm0wMi5jcmwwEwYDVR0gBAwwCjAIBgZn
                    gQwBAgEwdQYIKwYBBQUHAQEEaTBnMC0GCCsGAQUFBzABhiFodHRwOi8vb2NzcC5y
                    Mm0wMi5hbWF6b250cnVzdC5jb20wNgYIKwYBBQUHMAKGKmh0dHA6Ly9jcnQucjJt
                    MDIuYW1hem9udHJ1c3QuY29tL3IybTAyLmNlcjAMBgNVHRMBAf8EAjAAMIIBfgYK
                    KwYBBAHWeQIEAgSCAW4EggFqAWgAdgDuzdBk1dsazsVct520zROiModGfLzs3sNR
                    SFlGcR+1mwAAAYgTgMKgAAAEAwBHMEUCIHtTzRueHJdgA2Wq32YkXNXRJ1ZRD2uC
                    QCn025Jin2hCAiEAlV/lCQaMq1JoBRlULDV7n9f/VS8+xyJSVgMFRFwFtzsAdgBI
                    sONr2qZHNA/lagL6nTDrHFIBy1bdLIHZu7+rOdiEcwAAAYgTgMLXAAAEAwBHMEUC
                    IAKsJE1jj4gpyaa2VgkbHFszMoco2rABil1iy2YvVzmTAiEAsuzpO1atz7WIx1CM
                    MU9iMqq58yDpLhjQFktRuWamDlsAdgDatr9rP7W2Ip+bwrtca+hwkXFsu1GEhTS9
                    pD0wSNf7qwAAAYgTgMKjAAAEAwBHMEUCIHuwITeM92ncsbOvXgXPQjLHDLgReknJ
                    TUoo4uIlPetJAiEApQ3W+NHlj6/RhckoAxGn4zE1alq+Y3Bk3JUFAvDrR78wDQYJ
                    KoZIhvcNAQELBQADggEBAFNUUzuzuuDQMUvefHzllQPg/zbGNeDRZeOomSl1FrxS
                    FJ0CA2vznfoTXAJLS2/aWlQT9mR3h6WlxI5XSUaLrzcZi94F+l6Ixn8DJUhfgf+O
                    ZUxtmBX91AEQ1ccU+Odj2ILrWdSs28J82ODoPlkJ6OqIYo+kEXrUwy8SM2N9iFJw
                    HgZNOwzPQ2Ox/ozlRh6/6OUgYZ84j343BoDnNbTQijLBe6HL4pVw4nPKWrUQnTot
                    xMymAcBknnb4X4TcmEoJ0CrB1H6FKfe8yASCLjwSC72Os9ADyADMZqTUSOH1V8Vh
                    R3Zv4DlLItu8BHaE59teueLM9AW1PBFMci5JiYrgLEM=
                    -----END CERTIFICATE-----
                EOT
              - is_ca                = false
              - issuer               = "CN=Amazon RSA 2048 M02,O=Amazon,C=US"
              - not_after            = "2024-06-10T23:59:59Z"
              - not_before           = "2023-05-13T00:00:00Z"
              - public_key_algorithm = "RSA"
              - serial_number        = "9489663917354420509896793514074254267"
              - sha1_fingerprint     = "aaa68bb211d468db8a8a19561ccba2e4043dcc80"
              - signature_algorithm  = "SHA256-RSA"
              - subject              = "CN=oidc.eks.us-east-1.amazonaws.com"
              - version              = 3
            },
        ] -> (known after apply)
      ~ id           = "5933588ce34e24e9fb40c3565fb0b5993639df67" -> (known after apply)
      - verify_chain = true -> null
        # (1 unchanged attribute hidden)
    }

  # aws_eks_addon.eks_addon_aws_ebs_csi_driver must be replaced
-/+ resource "aws_eks_addon" "eks_addon_aws_ebs_csi_driver" {
      ~ addon_version            = "v1.27.0-eksbuild.1" -> (known after apply)
      ~ arn                      = "arn:aws:eks:us-east-1:512686554592:addon/kubernetes-aws--flux-test/aws-ebs-csi-driver/82c42b7f-e335-3be8-6d26-fbeebc4342a6" -> (known after apply)
      ~ cluster_name             = "kubernetes-aws--flux-test" -> (known after apply) # forces replacement
      + configuration_values     = (known after apply)
      ~ created_at               = "2023-05-26T07:39:43Z" -> (known after apply)
      ~ id                       = "kubernetes-aws--flux-test:aws-ebs-csi-driver" -> (known after apply)
      ~ modified_at              = "2024-02-07T15:54:47Z" -> (known after apply)
        tags                     = {
            "Cluster"     = "kubernetes-aws--flux-test"
            "Environment" = "flux-test"
            "Name"        = "kubernetes-aws--flux-test"
            "Project"     = "kubernetes-aws"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_eks_addon.eks_addon_coredns must be replaced
-/+ resource "aws_eks_addon" "eks_addon_coredns" {
      ~ addon_version        = "v1.10.1-eksbuild.7" -> (known after apply)
      ~ arn                  = "arn:aws:eks:us-east-1:512686554592:addon/kubernetes-aws--flux-test/coredns/0ec40f31-9887-05a5-187a-185659804536" -> (known after apply)
      ~ cluster_name         = "kubernetes-aws--flux-test" -> (known after apply) # forces replacement
      + configuration_values = (known after apply)
      ~ created_at           = "2023-05-15T07:49:57Z" -> (known after apply)
      ~ id                   = "kubernetes-aws--flux-test:coredns" -> (known after apply)
      ~ modified_at          = "2024-02-07T15:54:45Z" -> (known after apply)
        tags                 = {
            "Cluster"     = "kubernetes-aws--flux-test"
            "Environment" = "flux-test"
            "Name"        = "kubernetes-aws--flux-test"
            "Project"     = "kubernetes-aws"
        }
        # (3 unchanged attributes hidden)
    }

  # aws_eks_addon.eks_addon_kube_proxy must be replaced
-/+ resource "aws_eks_addon" "eks_addon_kube_proxy" {
      ~ addon_version        = "v1.27.8-eksbuild.4" -> (known after apply)
      ~ arn                  = "arn:aws:eks:us-east-1:512686554592:addon/kubernetes-aws--flux-test/kube-proxy/ccc40f35-74c0-4733-f037-2a92c153c47f" -> (known after apply)
      ~ cluster_name         = "kubernetes-aws--flux-test" -> (known after apply) # forces replacement
      + configuration_values = (known after apply)
      ~ created_at           = "2023-05-15T07:58:23Z" -> (known after apply)
      ~ id                   = "kubernetes-aws--flux-test:kube-proxy" -> (known after apply)
      ~ modified_at          = "2024-01-15T08:50:07Z" -> (known after apply)
        tags                 = {
            "Cluster"     = "kubernetes-aws--flux-test"
            "Environment" = "flux-test"
            "Name"        = "kubernetes-aws--flux-test"
            "Project"     = "kubernetes-aws"
        }
        # (3 unchanged attributes hidden)
    }

  # aws_eks_addon.eks_addon_vpc_cni must be replaced
-/+ resource "aws_eks_addon" "eks_addon_vpc_cni" {
      ~ addon_version            = "v1.16.2-eksbuild.1" -> (known after apply)
      ~ arn                      = "arn:aws:eks:us-east-1:512686554592:addon/kubernetes-aws--flux-test/vpc-cni/76c42b72-7c93-c831-fdff-681e365fb07c" -> (known after apply)
      ~ cluster_name             = "kubernetes-aws--flux-test" -> (known after apply) # forces replacement
      + configuration_values     = (known after apply)
      ~ created_at               = "2023-05-26T07:10:26Z" -> (known after apply)
      ~ id                       = "kubernetes-aws--flux-test:vpc-cni" -> (known after apply)
      ~ modified_at              = "2024-02-07T15:54:45Z" -> (known after apply)
        tags                     = {
            "Cluster"     = "kubernetes-aws--flux-test"
            "Environment" = "flux-test"
            "Name"        = "kubernetes-aws--flux-test"
            "Project"     = "kubernetes-aws"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_eks_cluster.main will be updated in-place
  ~ resource "aws_eks_cluster" "main" {
        id                        = "kubernetes-aws--flux-test"
        name                      = "kubernetes-aws--flux-test"
        tags                      = {}
      ~ version                   = "1.27" -> "1.28"
        # (10 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_iam_openid_connect_provider.default will be updated in-place
  ~ resource "aws_iam_openid_connect_provider" "default" {
        id              = "arn:aws:iam::512686554592:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/C44C02779528D1AE873C5052FC630D5C"
        tags            = {}
      ~ thumbprint_list = [
          - "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 4 to add, 2 to change, 4 to destroy.
```

I'm particularly perplexed by the OIDC and cert changes. I haven't come across any sense from upgrade docs that this would be an issue for 1.28, so I'll do a bit more reading before blindly applying this. If I get nowhere with that, I'll go ahead on flux-test to begin with.